; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v3)
             (pred_9 ?v1 ?v12)
             (pred_12 ?v10 ?v12)
             (pred_6 ?v8 ?v10 )
	     (pred_5 ?v10)
             (pred_1 ?v11)
             (pred_8 ?v1)
             (pred_2 ?v12)
             (pred_4 ?v10)
             (pred_7 ?v1)
             (pred_10 ?v10)
             (pred_11 ))



(:action op_4
:parameters (?v2 ?v9 ?v4 ?v13)
:precondition (and (pred_1 ?v2) (pred_1 ?v9) (pred_8 ?v4) (pred_2 ?v13)
          (pred_3 ?v2 ?v9) (pred_9 ?v4 ?v13)
                   (pred_12 ?v9 ?v13) (pred_5 ?v2) 
                   (pred_4 ?v9) (pred_7 ?v4))
:effect (and  (pred_10 ?v9) (not (pred_4 ?v9))))


(:action op_1
:parameters (?v2 ?v7)
:precondition (and (pred_1 ?v2) (pred_1 ?v7)
               (pred_5 ?v2) (pred_3 ?v2 ?v7) (pred_10 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v2))))

(:action op_2
:parameters (?v2 ?v4)
:precondition (and (pred_1 ?v2) (pred_8 ?v4) 
                  (pred_5 ?v2) (pred_6 ?v4 ?v2) (pred_11 ))
:effect (and (pred_7 ?v4)
   (not (pred_6 ?v4 ?v2)) (not (pred_11 ))))


(:action op_3
:parameters (?v2 ?v6 ?v5)
:precondition (and (pred_1 ?v2) (pred_8 ?v6) (pred_8 ?v5)
                  (pred_5 ?v2) (pred_7 ?v5) (pred_6 ?v6 ?v2))
:effect (and (pred_7 ?v6) (pred_6 ?v5 ?v2)
        (not (pred_7 ?v5)) (not (pred_6 ?v6 ?v2))))

(:action op_5
:parameters (?v2 ?v4)
:precondition (and (pred_1 ?v2) (pred_8 ?v4) 
                  (pred_5 ?v2) (pred_7 ?v4))
:effect (and (pred_11 ) (pred_6 ?v4 ?v2) (not (pred_7 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_20 obj_13 obj_12 obj_19 obj_06 obj_05 obj_04 obj_02 obj_07 obj_01 obj_17 obj_14 obj_11 obj_09 obj_18
    obj_15 obj_10
    obj_08 obj_16
    )

    (:init
       (pred_11)

       (pred_1 obj_03)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_05)
       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_18)
       (pred_2 obj_15)
       (pred_2 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_16)

       (pred_3 obj_03 obj_19)
       (pred_3 obj_03 obj_20)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_03)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_06)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_19)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_13)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_09)
       (pred_4 obj_06)
       (pred_4 obj_19)
       (pred_12  obj_06 obj_15)
       (pred_12  obj_19 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_09)
       (pred_10 obj_18)

       (pred_9  obj_08 obj_15)
       (pred_9  obj_16 obj_10)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_16 obj_11)
       (pred_5 obj_03)
    )

    (:goal (and
       (pred_6 obj_16 obj_14)
    ))
(:constraints
  (always (not (pred_5 obj_01)))
)
)

; plan
1. (op_1 obj_03 obj_20)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_20)
   goals met: 0 of 1
2. (op_1 obj_20 obj_13)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_05)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_04)
   goals met: 0 of 1
5. (op_1 obj_04 obj_17)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_17)
   goals met: 0 of 1
6. (op_1 obj_17 obj_18)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_18)
   goals met: 0 of 1
7. (op_1 obj_18 obj_09)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_09)
   goals met: 0 of 1
8. (op_1 obj_09 obj_11)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_11)
   goals met: 0 of 1
9. (op_2 obj_11 obj_16)
   deleted: (pred_6 obj_16 obj_11) (pred_11)
   added: (pred_7 obj_16)
   goals met: 0 of 1
10. (op_1 obj_11 obj_14)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_14)
   goals met: 0 of 1
11. (op_5 obj_14 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_11) (pred_6 obj_16 obj_14)
   goals met: 1 of 1
